{
  "backend/main.mo": "Main actor handling maintenance mode, user profiles, and quote requests with admin authorization and new List-based quote storage.",
  "backend/migration.mo": "Migrates old Map-based quote requests to the new List format while adding createdBy fields.",
  "feature_evidence.json": "Feature evidence report linking updated quote storage changes to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file summarizing the purpose of each frontend source file, including pages, hooks, and assets.",
  "frontend/CUSTOM_DOMAIN_DEPLOYMENT.md": "Guide describing how to deploy the app to a custom domain on the Internet Computer.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH variables and theme definitions for light and dark modes.",
  "frontend/index.html": "Base HTML file loading the React app with favicon and root mount point.",
  "frontend/src/App.tsx": "Top-level app component managing navigation, maintenance mode gating, and page rendering.",
  "frontend/src/components/AdminAuthGate.tsx": "Wrapper component enforcing admin authentication and showing appropriate login or denial states.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying company info, services, contact details, service area, and copyright.",
  "frontend/src/components/SiteHeader.tsx": "Navigation header with desktop/mobile menus, admin links, and phone CTA using auth state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Checks if the authenticated user is an admin by querying the actor and exposes admin auth state.",
  "frontend/src/hooks/useAdminQuotes.ts": "Loads all quote requests for admins using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state through a React context.",
  "frontend/src/hooks/useMaintenanceMode.ts": "Fetches and updates maintenance‑mode status via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Submits quote requests to the backend and invalidates related queries.",
  "frontend/src/index.css": "Tailwind base styles and custom theming with light/dark color variables and layout utilities.",
  "frontend/src/main.tsx": "App bootstrap wiring React Query and Internet Identity providers around the root component.",
  "frontend/src/pages/AdminLoginPage.tsx": "Admin login UI using Internet Identity with sign‑in, sign‑out, and status display.",
  "frontend/src/pages/BeforeAfterGalleryPage.tsx": "Empty page placeholder for a before/after gallery.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with hero content, feature highlights, and navigation actions for calling or requesting a quote.",
  "frontend/src/pages/MaintenancePage.tsx": "Displays a maintenance notice with contact info and provides a button to navigate to the admin login.",
  "frontend/src/pages/OtherJobsPage.tsx": "Shows a grid of additional services with icons, descriptions, and images, along with supporting header sections.",
  "frontend/src/pages/QuoteRequestPage.tsx": "Implements a quote request form with validation, submission handling, and success messaging.",
  "frontend/src/pages/ViewQuotesPage.tsx": "Admin-only page that lists submitted quotes, handles loading and error states, and provides maintenance mode controls.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file describing project requirements, architectural notes, known issues, and desired updates for the Pane Pros of Plano website."
}